protogia/avr-descriptionfiles-4-nim/svd/ATmega406.atdf.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Atmel</vendor>
  <name>ATmega406</name>
  <version>1.0</version>
  <description>No description available.</description>
  <cpu>
    <name>other</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>8</width>
  <size>0x8</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000FF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x00000078</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VADC</name>
          <description>VADC Data Register  Bytes</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>VADCSR</name>
          <description>The VADC Control and Status register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VADCCIE</name>
              <description>VADC Conversion Complete Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADCCIF</name>
              <description>VADC Conversion Complete Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADSC</name>
              <description>VADC Satrt Conversion</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADEN</name>
              <description>VADC Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VADMUX</name>
          <description>The VADC multiplexer Selection Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VADMUX</name>
              <description>Analog Channel and Gain Selection Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BANDGAP</name>
      <description>Bandgap</description>
      <baseAddress>0x000000D0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BGCCR</name>
          <description>Bandgap Calibration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BGCC</name>
              <description>BG Calibration of PTAT Current Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BGD</name>
              <description>Setting the BGD bit to one will disable the bandgap voltage reference. This bit must be cleared before enabling CC-ADC or V-ADC, and must remain unset while either ADC is enabled.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCRR</name>
          <description>Bandgap Calibration of Resistor Ladder</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BATTERY_PROTECTION</name>
      <description>Battery Protection</description>
      <baseAddress>0x000000F2</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BPCR</name>
          <description>Battery Protection Control Register</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCD</name>
              <description>No Description.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCD</name>
              <description>No Description.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCD</name>
              <description>No Description.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUVD</name>
              <description>No Description.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BPDUV</name>
          <description>Battery Protection Deep Under Voltage Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DUDL</name>
              <description>No Description.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_71V</name>
                  <description>4.71V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_03V</name>
                  <description>5.03V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_34V</name>
                  <description>5.34V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_66V</name>
                  <description>5.66V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_97V</name>
                  <description>5.97V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_29V</name>
                  <description>6.29V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_60V</name>
                  <description>6.60V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_91V</name>
                  <description>6.91V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_23V</name>
                  <description>7.23V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_54V</name>
                  <description>7.54V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_86V</name>
                  <description>7.86V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_17V</name>
                  <description>8.17V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_49V</name>
                  <description>8.49V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_80V</name>
                  <description>8.80V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9_11V</name>
                  <description>9.11V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9_43V</name>
                  <description>9.43V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUVT</name>
              <description>No Description.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>750MS</name>
                  <description>750ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000MS</name>
                  <description>1000ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1250MS</name>
                  <description>1250ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1500MS</name>
                  <description>1500ms</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BPIR</name>
          <description>Battery Protection Interrupt Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCIE</name>
              <description>No Description.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DOCIE</name>
              <description>No Description.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COCIE</name>
              <description>No Description.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUVIE</name>
              <description>Deep Under-voltage Early Warning Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCIF</name>
              <description>No Description.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DOCIF</name>
              <description>No Description.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COCIF</name>
              <description>Charge Over-current Protection Activated Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUVIF</name>
              <description>Deep Under-voltage Early Warning Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BPOCD</name>
          <description>Battery Protection OverCurrent Detection Level Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCDL</name>
              <description>No Description.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_050V</name>
                  <description>0.050V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_055V</name>
                  <description>0.055V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_060V</name>
                  <description>0.060V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_065V</name>
                  <description>0.065V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_070V</name>
                  <description>0.070V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_080V</name>
                  <description>0.080V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_090V</name>
                  <description>0.090V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_100V</name>
                  <description>0.100V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_110V</name>
                  <description>0.110V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_120V</name>
                  <description>0.120V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_130V</name>
                  <description>0.130V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_140V</name>
                  <description>0.140V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_160V</name>
                  <description>0.160V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_180V</name>
                  <description>0.180V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_200V</name>
                  <description>0.200V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_220V</name>
                  <description>0.220V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDL</name>
              <description>No Description.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_050V</name>
                  <description>0.050V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_055V</name>
                  <description>0.055V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_060V</name>
                  <description>0.060V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_065V</name>
                  <description>0.065V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_070V</name>
                  <description>0.070V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_080V</name>
                  <description>0.080V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_090V</name>
                  <description>0.090V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_100V</name>
                  <description>0.100V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_110V</name>
                  <description>0.110V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_120V</name>
                  <description>0.120V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_130V</name>
                  <description>0.130V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_140V</name>
                  <description>0.140V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_160V</name>
                  <description>0.160V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_180V</name>
                  <description>0.180V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_200V</name>
                  <description>0.200V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_220V</name>
                  <description>0.220V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BPPLR</name>
          <description>Battery Protection Parameter Lock Register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BPPL</name>
              <description>Battery Protection Parameter Lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BPPLE</name>
              <description>Battery Protection Parameter Lock Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
