protogia/avr-descriptionfiles-4-nim/svd/ATmega406.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FET</name>
      <description>FET Control</description>
      <baseAddress>0x000000F0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FCSR</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PFD</name>
              <description>Precharge FET disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFE</name>
              <description>Charge FET Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DFE</name>
              <description>Discharge FET Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPS</name>
              <description>Current Protection Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMOPC</name>
              <description>Pulse Width Modulation Modulation of OPC output</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMOC</name>
              <description>Pulse Width Modulation of OC output</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HIGH</name>
          <description>No Description.</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JTAGEN</name>
              <description>JTAG Interface Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCDEN</name>
              <description>On-Chip Debug Enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Clock Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>14CK_0MS</name>
                  <description>Start-up time: 14 CK + 0 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_3MS9</name>
                  <description>Start-up time: 14 CK + 3.9 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14CK_62MS5</name>
                  <description>Start-up time: 14 CK + 62.5 ms</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTRST</name>
              <description>Boot Reset vector Enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTSZ</name>
              <description>Select boot size</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2048W_4800</name>
                  <description>Boot Flash size=2048 words Boot address=$4800</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024W_4C00</name>
                  <description>Boot Flash size=1024 words Boot address=$4C00</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512W_4E00</name>
                  <description>Boot Flash size=512 words Boot address=$4E00</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256W_4F00</name>
                  <description>Boot Flash size=256 words Boot address=$4F00</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watchdog timer always on</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
